import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 현재 또는 특정 위치를 표현합니다.
 * 키워드: GPS, Location, Place, 좌표, 위치
 * 속성: Outlined
 */
const IconLocation = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M16.4024 18.8796C15.4294 19.9049 14.4595 20.7426 13.734 21.3236C13.3344 21.6435 12.9277 21.9581 12.5038 22.2456C12.2033 22.4483 11.7937 22.4475 11.4936 22.2444C11.0704 21.9571 10.6642 21.6431 10.2652 21.3236C9.53962 20.7426 8.56974 19.9049 7.59675 18.8796C5.6907 16.8709 3.59961 13.9624 3.59961 10.7496C3.59961 6.11042 7.36041 2.34961 11.9996 2.34961C16.6388 2.34961 20.3996 6.11042 20.3996 10.7496C20.3996 13.9624 18.3085 16.8709 16.4024 18.8796ZM11.9996 4.14941C8.35452 4.14941 5.39961 7.10433 5.39961 10.7494C5.39961 13.2305 7.05851 15.6972 8.90244 17.6403C10.1139 18.917 11.3356 19.8935 11.9996 20.3906C12.6635 19.8935 13.8853 18.917 15.0967 17.6403C16.9407 15.6972 18.5996 13.2305 18.5996 10.7494C18.5996 7.10433 15.6447 4.14941 11.9996 4.14941Z"
        fill="currentColor"
      />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M11.9997 7.09961C9.98389 7.09961 8.34973 8.73377 8.34973 10.7496C8.34973 12.7654 9.98389 14.3996 11.9997 14.3996C14.0156 14.3996 15.6497 12.7654 15.6497 10.7496C15.6497 8.73377 14.0156 7.09961 11.9997 7.09961ZM10.1497 10.7496C10.1497 9.72788 10.978 8.89961 11.9997 8.89961C13.0214 8.89961 13.8497 9.72788 13.8497 10.7496C13.8497 11.7713 13.0214 12.5996 11.9997 12.5996C10.978 12.5996 10.1497 11.7713 10.1497 10.7496Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconLocation;
