import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 개인정보를 가릴 때 사용합니다.
 * 키워드: 가려진 정보, 뷰 슬래시, 안보임, 안 보임, 눈알 슬래시, View Slash, Can&Amp;#39;T See, Unseen, Slashed Eye, Hidden Eye
 * 속성: Solid
 */
const IconEyeSlashFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M4.63664 4.11321C4.28517 3.76174 3.71532 3.76174 3.36385 4.11321C3.01238 4.46469 3.01238 5.03453 3.36385 5.38601L5.06911 7.09127C3.69533 8.22593 2.60433 9.69077 1.91763 11.3643C1.75076 11.7709 1.75076 12.2274 1.91763 12.634C3.54639 16.6034 7.44967 19.3988 12.0059 19.3988C13.584 19.3988 15.0838 19.0634 16.4379 18.4601L18.3638 20.386C18.7153 20.7375 19.2852 20.7375 19.6366 20.386C19.9881 20.0345 19.9881 19.4647 19.6366 19.1132L4.63664 4.11321ZM13.5554 15.5775L12.0765 14.0986C12.0511 14.0995 12.0257 14.1 12.0001 14.1C10.8403 14.1 9.90014 13.1598 9.90014 12C9.90014 11.9744 9.9006 11.949 9.9015 11.9237L8.42258 10.4447C8.21516 10.9212 8.10014 11.4472 8.10014 12C8.10014 14.1539 9.84623 15.9 12.0001 15.9C12.553 15.9 13.0789 15.785 13.5554 15.5775Z"
        fill="currentColor"
      />
      <path
        d="M15.819 12.7951L19.468 16.4441C20.5955 15.3848 21.4974 14.0882 22.0941 12.634C22.261 12.2274 22.261 11.7709 22.0941 11.3643C20.4654 7.39494 16.5621 4.59946 12.0059 4.59946C10.6964 4.59946 9.44078 4.83039 8.27764 5.25374L11.205 8.18109C11.4617 8.12792 11.7277 8.09998 12.0001 8.09998C14.1541 8.09998 15.9001 9.84607 15.9001 12C15.9001 12.2725 15.8722 12.5384 15.819 12.7951Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconEyeSlashFill;
