import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 애플 로고를 표현합니다.
 * 키워드: 애플, 로고, Apple, Icon, Size, Small
 */
const IconLogoAppleColor = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M8.95556 21.4457C10.2363 21.4457 10.798 20.5581 12.3933 20.5581C13.9886 20.5581 14.3706 21.412 15.7861 21.412C17.2017 21.412 18.1117 20.0863 18.9992 18.7831C19.9879 17.2889 20.3923 15.8284 20.426 15.761C20.3361 15.7385 17.6623 14.6038 17.6623 11.4469C17.6623 8.70568 19.7744 7.46987 19.8867 7.38C18.4937 5.31284 16.3703 5.2679 15.7974 5.2679C14.2358 5.2679 12.955 6.24531 12.1462 6.24531C11.2811 6.24531 10.1352 5.32407 8.7758 5.32407C6.19186 5.32407 3.57422 7.52605 3.57422 11.6716C3.57422 14.2443 4.55162 16.9743 5.74248 18.7381C6.76482 20.2323 7.66359 21.4569 8.95556 21.4569V21.4457ZM12.2473 5.02074C13.1797 5.02074 14.3594 4.36913 15.0559 3.50407C15.685 2.71765 16.1457 1.61666 16.1457 0.515677C16.1457 0.369628 16.1344 0.212344 16.1007 0.0999985C15.0559 0.144937 13.8089 0.819012 13.0562 1.72901C12.4607 2.42555 11.9215 3.50407 11.9215 4.61629C11.9215 4.77358 11.9439 4.9421 11.9664 4.99827C12.0338 5.0095 12.1349 5.02074 12.2473 5.02074Z"
        fill="black"
      />
    </Box>
  );
});

export default IconLogoAppleColor;
