import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 콘텐츠를 일시정지할 때 사용합니다.
 * 키워드: Pause, 일시정지, 정지, 잠깐, Wait
 * 속성: Outlined
 */
const IconPause = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M5.75 6V18C5.75 18.465 5.75 18.6975 5.80111 18.8882C5.93981 19.4059 6.34413 19.8102 6.86177 19.9489C7.05252 20 7.28501 20 7.74999 20C8.21498 20 8.44747 20 8.63822 19.9489C9.15586 19.8102 9.56018 19.4059 9.69888 18.8882C9.74999 18.6975 9.74999 18.465 9.74999 18V6C9.74999 5.53501 9.74999 5.30252 9.69888 5.11177C9.56018 4.59413 9.15586 4.18981 8.63822 4.05111C8.44747 4 8.21498 4 7.74999 4C7.28501 4 7.05252 4 6.86177 4.05111C6.34413 4.18981 5.93981 4.59413 5.80111 5.11177C5.75 5.30252 5.75 5.53501 5.75 6Z"
        fill="currentColor"
      />
      <path
        d="M18.1989 5.11177C18.25 5.30252 18.25 5.53501 18.25 6V18C18.25 18.465 18.25 18.6975 18.1989 18.8882C18.0602 19.4059 17.6558 19.8102 17.1382 19.9489C16.9474 20 16.715 20 16.25 20C15.785 20 15.5525 20 15.3617 19.9489C14.8441 19.8102 14.4398 19.4059 14.3011 18.8882C14.25 18.6975 14.25 18.465 14.25 18V6C14.25 5.53501 14.25 5.30252 14.3011 5.11177C14.4398 4.59413 14.8441 4.18981 15.3617 4.05111C15.5525 4 15.785 4 16.25 4C16.715 4 16.9474 4 17.1382 4.05111C17.6558 4.18981 18.0602 4.59413 18.1989 5.11177Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconPause;
