import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 커피를 표현합니다.
 * 키워드: Coffee, Coffeechat, 커피챗
 * 속성: Solid
 */
const IconCoffeeFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M5.86725 3.09522H16.1339C16.5254 3.0952 16.8719 3.09518 17.1591 3.11864C17.4649 3.14363 17.7817 3.19964 18.0902 3.3568C18.5418 3.5869 18.9089 3.95405 19.139 4.40564C19.256 4.63528 19.317 4.86957 19.3508 5.10049H19.7496C22.0416 5.10049 23.8996 6.95851 23.8996 9.25049C23.8996 11.5425 22.0416 13.4005 19.7496 13.4005H18.4397C17.034 16.0732 14.2305 17.8962 11.001 17.8962C6.36167 17.8962 2.60059 14.1343 2.60059 9.49522V6.36188C2.60057 5.97038 2.60055 5.62388 2.62401 5.33673C2.649 5.03095 2.70501 4.7141 2.86217 4.40564C3.09227 3.95405 3.45942 3.5869 3.91101 3.3568C4.21947 3.19964 4.53632 3.14363 4.8421 3.11864C5.12924 3.09518 5.47578 3.0952 5.86725 3.09522ZM19.7496 6.90049H19.4006V9.49522C19.4006 10.2222 19.3082 10.9277 19.1346 11.6005H19.7496C21.0475 11.6005 22.0996 10.5484 22.0996 9.25049C22.0996 7.95262 21.0475 6.90049 19.7496 6.90049Z"
        fill="currentColor"
      />
      <path
        d="M4.75073 20.0995C4.25368 20.0995 3.85073 20.5025 3.85073 20.9995C3.85073 21.4966 4.25368 21.8995 4.75073 21.8995H17.7507C18.2478 21.8995 18.6507 21.4966 18.6507 20.9995C18.6507 20.5025 18.2478 20.0995 17.7507 20.0995H4.75073Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconCoffeeFill;
