import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 사각형을 표현합니다.
 * 키워드: Square, Rectangle, 정사각형, 사각형
 * 속성: Solid
 */
const IconSquareFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M8.26238 2.59961C7.45433 2.5996 6.79347 2.59959 6.2564 2.64347C5.70049 2.68889 5.19841 2.78577 4.72953 3.02468C3.9957 3.39859 3.39908 3.99521 3.02517 4.72905C2.78626 5.19794 2.68938 5.70001 2.64396 6.25593C2.60008 6.793 2.60009 7.45385 2.6001 8.2619V15.7373C2.60009 16.5454 2.60008 17.2062 2.64396 17.7433C2.68938 18.2992 2.78626 18.8013 3.02517 19.2702C3.39908 20.004 3.9957 20.6006 4.72953 20.9745C5.19841 21.2134 5.70049 21.3103 6.2564 21.3557C6.79348 21.3996 7.45432 21.3996 8.26237 21.3996H15.7378C16.5458 21.3996 17.2066 21.3996 17.7437 21.3557C18.2996 21.3103 18.8017 21.2134 19.2706 20.9745C20.0044 20.6006 20.601 20.004 20.975 19.2702C21.2139 18.8013 21.3107 18.2992 21.3562 17.7433C21.4 17.2062 21.4 16.5454 21.4 15.7373V8.26191C21.4 7.45385 21.4 6.793 21.3562 6.25593C21.3107 5.70001 21.2139 5.19794 20.975 4.72905C20.601 3.99521 20.0044 3.39859 19.2706 3.02468C18.8017 2.78577 18.2996 2.68889 17.7437 2.64347C17.2066 2.59959 16.5458 2.5996 15.7378 2.59961H8.26238Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconSquareFill;
