import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 해시태그를 표현합니다.
 * 키워드: Hashtag, tag, 해시태그, 태그, 해시태그, 샵
 * 속성: Outlined
 */
const IconHashTag = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M16.8306 3.06787C16.9593 2.58809 17.4532 2.30275 17.9331 2.43115C18.4132 2.5598 18.6985 3.05455 18.5698 3.53467L17.4976 7.5376H21.8706C22.3676 7.53765 22.7709 7.94101 22.771 8.43799C22.771 8.93501 22.3676 9.33832 21.8706 9.33838H17.0151L15.6226 14.5376H20.1206C20.6176 14.5376 21.0209 14.941 21.021 15.438C21.021 15.935 20.6176 16.3383 20.1206 16.3384H15.1392L13.9116 20.9214C13.7829 21.4014 13.2881 21.6867 12.8081 21.5581C12.3282 21.4293 12.0428 20.9346 12.1714 20.4546L13.2739 16.3384H8.13916L6.91162 20.9214C6.78288 21.4014 6.28815 21.6867 5.80811 21.5581C5.32815 21.4293 5.04276 20.9346 5.17139 20.4546L6.27393 16.3384H2.12061C1.62355 16.3384 1.22021 15.935 1.22021 15.438C1.22026 14.941 1.62358 14.5376 2.12061 14.5376H6.75635L8.1499 9.33838H3.87061C3.37355 9.33838 2.97021 8.93504 2.97021 8.43799C2.97027 7.94097 3.37358 7.5376 3.87061 7.5376H8.63232L9.83057 3.06787C9.95935 2.58809 10.4532 2.30275 10.9331 2.43115C11.4132 2.5598 11.6985 3.05455 11.5698 3.53467L10.4976 7.5376H15.6323L16.8306 3.06787ZM8.62256 14.5376H13.7563L15.1499 9.33838H10.0151L8.62256 14.5376Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconHashTag;
