import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 이해에 도움이 되는 정보를 표시할 때 사용합니다.
 * 키워드: 물음표, 추가 정보, Question, Additional Information
 * 속성: Outlined
 */
const IconCircleQuestion = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M11.1897 13.0143C11.1028 13.4913 11.5093 13.8903 11.9941 13.8903C12.4782 13.8903 12.8454 13.484 13.0071 13.0278C13.2204 12.4259 13.6531 12.0642 14.0839 11.7042C14.6812 11.2048 15.275 10.7085 15.275 9.57896C15.275 7.83093 13.8586 6.80147 12.0553 6.80147C10.4165 6.80147 9.18051 7.66541 8.81928 9.06785C8.69831 9.53749 9.10535 9.93823 9.59032 9.93823C10.0741 9.93823 10.4294 9.51975 10.6537 9.09116C10.8948 8.63041 11.3584 8.36752 11.9862 8.36294C12.8499 8.36985 13.451 8.86731 13.451 9.64805C13.451 10.2803 13.0553 10.5813 12.5898 10.9355C12.0449 11.35 11.4041 11.8375 11.1897 13.0143Z"
        fill="currentColor"
      />
      <path
        d="M10.8807 16.0598C10.8738 16.6816 11.3437 17.1376 12 17.1376C12.6426 17.1376 13.1124 16.6816 13.1193 16.0598C13.1124 15.4379 12.6426 14.9819 12 14.9819C11.3437 14.9819 10.8738 15.4379 10.8807 16.0598Z"
        fill="currentColor"
      />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M11.9999 2.09961C6.53231 2.09961 2.09995 6.53199 2.09995 11.9996C2.09995 17.4672 6.53231 21.8996 11.9999 21.8996C17.4675 21.8996 21.8999 17.4672 21.8999 11.9996C21.8999 6.53199 17.4675 2.09961 11.9999 2.09961ZM3.89994 11.9996C3.89994 7.5261 7.52642 3.89961 11.9999 3.89961C16.4734 3.89961 20.0999 7.5261 20.0999 11.9996C20.0999 16.4731 16.4734 20.0996 11.9999 20.0996C7.52642 20.0996 3.89994 16.4731 3.89994 11.9996Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconCircleQuestion;
