import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 새 정보와 관련한 내용을 표현할 때 사용합니다.
 * 키워드: 노티피케이션, 벨, 알람, Ring, Bell, Alarm Center, Notification, Noti, Notify
 * 속성: Outlined
 */
const IconBell = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M11.9998 2.1001C9.77452 2.1001 7.94513 2.88789 6.68765 4.37443C5.44752 5.84044 4.84978 7.8832 4.84978 10.2501L4.84978 11.0001C4.84978 13.4652 4.16655 14.9249 3.19343 15.8682C2.81189 16.2381 2.77229 16.7499 2.90867 17.1264C3.04738 17.5094 3.42748 17.9001 3.99934 17.9001H20.0002C20.572 17.9001 20.9521 17.5094 21.0908 17.1264C21.2272 16.7499 21.1876 16.2381 20.8061 15.8682C19.833 14.9249 19.1497 13.4652 19.1497 11.0001L19.1497 10.2501C19.1497 7.8832 18.552 5.84044 17.3119 4.37443C16.0544 2.88789 14.225 2.1001 11.9998 2.1001ZM6.64978 10.2501C6.64978 8.16522 7.17703 6.58298 8.0619 5.53693C8.9294 4.51142 10.225 3.9001 11.9998 3.9001C13.7745 3.9001 15.0701 4.51142 15.9376 5.53693C16.8225 6.58297 17.3497 8.16522 17.3497 10.2501L17.3497 11.0001C17.3497 13.1628 17.8179 14.8273 18.6684 16.1001H5.33106C6.18164 14.8273 6.64978 13.1628 6.64978 11.0001L6.64978 10.2501Z"
        fill="currentColor"
      />
      <path
        d="M9.99977 20.0999C9.50271 20.0999 9.09977 20.5029 9.09977 20.9999C9.09977 21.497 9.50271 21.8999 9.99977 21.8999H13.9998C14.4968 21.8999 14.8997 21.497 14.8997 20.9999C14.8997 20.5029 14.4968 20.0999 13.9998 20.0999H9.99977Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconBell;
