import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 우수한 상태 및 정보를 표현합니다.
 * 키워드: 트로피, 우승, 우수한, 최고, Trophy, Best, Extraordinary
 * 속성: Solid
 */
const IconTrophyFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M5.59998 3.9996C5.59998 3.50255 6.00293 3.09961 6.49998 3.09961H17.4999C17.7386 3.09961 17.9676 3.19443 18.1363 3.36322C18.3051 3.532 18.3999 3.76092 18.3999 3.99962L18.3999 6.59961H21.9997C22.4968 6.59961 22.8997 7.00256 22.8997 7.49961C22.8997 13.1094 18.4582 17.6818 12.8999 17.8921V20.0996H17.4999C17.9969 20.0996 18.3999 20.5026 18.3999 20.9996C18.3999 21.4967 17.9969 21.8996 17.4999 21.8996H6.49992C6.00286 21.8996 5.59992 21.4967 5.59992 20.9996C5.59992 20.5026 6.00286 20.0996 6.49992 20.0996H11.0999V17.8921C5.54161 17.6818 1.1001 13.1094 1.1001 7.49961C1.1001 7.00256 1.50304 6.59961 2.0001 6.59961H5.59995L5.59998 3.9996ZM18.3999 9.29942L18.3999 8.39961H21.0532C20.8021 10.814 19.5522 12.9315 17.7238 14.3317C17.9994 13.7192 18.1795 13.0429 18.2817 12.2917L18.2834 12.2782C18.3673 11.5834 18.3999 10.702 18.3999 9.29942ZM5.72875 12.2889C5.83012 13.0522 6.00591 13.7256 6.27598 14.3316C4.44764 12.9315 3.19769 10.814 2.94662 8.39961H5.59993L5.59992 9.2994C5.59992 10.6376 5.63258 11.5317 5.72809 12.2838L5.72875 12.2889Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconTrophyFill;
