import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 레이아웃을 표현합니다.
 * 키워드: 템플릿, 레이아웃, 스플릿, Template, Layout, Split
 * 속성: Solid
 */
const IconTemplateFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M8.26238 2.60254H15.7378C16.5458 2.60253 17.2067 2.60252 17.7437 2.6464C18.2996 2.69182 18.8017 2.7887 19.2706 3.02762C20.0044 3.40152 20.6011 3.99815 20.975 4.73198C21.2139 5.20087 21.3108 5.70295 21.3562 6.25886C21.4001 6.79594 21.4 7.45679 21.4 8.26484V8.60079H2.6001V8.26484C2.60009 7.4568 2.60008 6.79593 2.64396 6.25886C2.68938 5.70295 2.78626 5.20087 3.02517 4.73198C3.39908 3.99815 3.9957 3.40152 4.72953 3.02762C5.19842 2.7887 5.70049 2.69182 6.2564 2.6464C6.79347 2.60252 7.45434 2.60253 8.26238 2.60254Z"
        fill="currentColor"
      />
      <path
        d="M2.6001 10.4008V15.7402C2.60009 16.5483 2.60008 17.2092 2.64396 17.7462C2.68938 18.3021 2.78626 18.8042 3.02517 19.2731C3.39908 20.0069 3.9957 20.6036 4.72953 20.9775C5.19842 21.2164 5.70049 21.3133 6.2564 21.3587C6.79348 21.4026 7.45432 21.4026 8.26237 21.4025H8.59974V10.4008H2.6001Z"
        fill="currentColor"
      />
      <path
        d="M10.3997 21.4025H15.7378C16.5458 21.4026 17.2067 21.4026 17.7437 21.3587C18.2996 21.3133 18.8017 21.2164 19.2706 20.9775C20.0044 20.6036 20.6011 20.0069 20.975 19.2731C21.2139 18.8042 21.3108 18.3021 21.3562 17.7462C21.4001 17.2092 21.4 16.5483 21.4 15.7403V10.4008H10.3997V21.4025Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconTemplateFill;
