import { Box } from '@montage-ui/engine';
import { forwardRef } from 'react';

import type { SxProp } from '@montage-ui/engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 이해에 도움이 되는 정보를 표시할 때 사용합니다.
 * 키워드: 물음표, 추가 정보, Question, Additional Information
 * 속성: Outlined
 */
const IconCircleQuestion = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M11.1899 13.0143C11.1029 13.4913 11.5094 13.8903 11.9942 13.8903C12.4783 13.8903 12.8455 13.484 13.0072 13.0278C13.2205 12.4259 13.6532 12.0642 14.084 11.7042C14.6814 11.2048 15.2751 10.7085 15.2751 9.57896C15.2751 7.83093 13.8587 6.80147 12.0555 6.80147C10.4166 6.80147 9.18067 7.66541 8.81943 9.06785C8.69847 9.53749 9.1055 9.93823 9.59047 9.93823C10.0742 9.93823 10.4295 9.51975 10.6538 9.09116C10.8949 8.63041 11.3586 8.36752 11.9864 8.36294C12.85 8.36985 13.4511 8.86731 13.4511 9.64805C13.4511 10.2803 13.0555 10.5813 12.5899 10.9355C12.045 11.35 11.4043 11.8375 11.1899 13.0143Z"
        fill="currentColor"
      />
      <path
        d="M10.8809 16.0598C10.874 16.6816 11.3438 17.1376 12.0002 17.1376C12.6427 17.1376 13.1126 16.6816 13.1195 16.0598C13.1126 15.4379 12.6427 14.9819 12.0002 14.9819C11.3438 14.9819 10.874 15.4379 10.8809 16.0598Z"
        fill="currentColor"
      />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M12.0001 2.09961C6.53246 2.09961 2.1001 6.53199 2.1001 11.9996C2.1001 17.4672 6.53246 21.8996 12.0001 21.8996C17.4677 21.8996 21.9 17.4672 21.9 11.9996C21.9 6.53199 17.4677 2.09961 12.0001 2.09961ZM3.90009 11.9996C3.90009 7.5261 7.52657 3.89961 12.0001 3.89961C16.4735 3.89961 20.1 7.5261 20.1 11.9996C20.1 16.4731 16.4735 20.0996 12.0001 20.0996C7.52657 20.0996 3.90009 16.4731 3.90009 11.9996Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconCircleQuestion;
