import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 애플 로고를 표현합니다.
 * 키워드: Apple Logo, 애플 로고
 * 속성: Outlined
 */
const IconLogoApple = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M8.95556 21.4472C10.2363 21.4472 10.798 20.5597 12.3933 20.5597C13.9886 20.5597 14.3706 21.4135 15.7861 21.4135C17.2017 21.4135 18.1117 20.0879 18.9992 18.7846C19.9879 17.2904 20.3923 15.83 20.426 15.7625C20.3361 15.7401 17.6623 14.6054 17.6623 11.4485C17.6623 8.70724 19.7744 7.47144 19.8867 7.38156C18.4937 5.3144 16.3703 5.26946 15.7974 5.26946C14.2358 5.26946 12.955 6.24687 12.1462 6.24687C11.2811 6.24687 10.1352 5.32564 8.7758 5.32564C6.19186 5.32564 3.57422 7.52761 3.57422 11.6732C3.57422 14.2459 4.55162 16.9759 5.74248 18.7397C6.76482 20.2339 7.66359 21.4585 8.95556 21.4585V21.4472ZM12.2473 5.0223C13.1797 5.0223 14.3594 4.3707 15.0559 3.50564C15.685 2.71922 16.1457 1.61823 16.1457 0.517241C16.1457 0.371192 16.1344 0.213908 16.1007 0.101562C15.0559 0.146501 13.8089 0.820576 13.0562 1.73058C12.4607 2.42712 11.9215 3.50564 11.9215 4.61786C11.9215 4.77514 11.9439 4.94366 11.9664 4.99983C12.0338 5.01107 12.1349 5.0223 12.2473 5.0223Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconLogoApple;
