import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 우수한 상태 및 정보를 표현합니다.
 * 키워드: 트로피, 우승, 우수한, 최고, Trophy, Best, Extraordinary
 * 속성: Solid
 */
const IconTrophyFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M5.59992 3.9996C5.59992 3.50255 6.00286 3.09961 6.49992 3.09961H17.4999C17.7386 3.09961 17.9675 3.19443 18.1363 3.36322C18.3051 3.532 18.3999 3.76092 18.3999 3.99962L18.3998 6.59961H21.9997C22.4967 6.59961 22.8997 7.00256 22.8997 7.49961C22.8997 13.1094 18.4581 17.6818 12.8998 17.8921V20.0996H17.4998C17.9969 20.0996 18.3998 20.5026 18.3998 20.9996C18.3998 21.4967 17.9969 21.8996 17.4998 21.8996H6.49985C6.0028 21.8996 5.59986 21.4967 5.59986 20.9996C5.59986 20.5026 6.0028 20.0996 6.49985 20.0996H11.0998V17.8921C5.54155 17.6818 1.10004 13.1094 1.10004 7.49961C1.10004 7.00256 1.50298 6.59961 2.00003 6.59961H5.59989L5.59992 3.9996ZM18.3998 9.29942L18.3998 8.39961H21.0532C20.8021 10.814 19.5521 12.9315 17.7238 14.3317C17.9994 13.7192 18.1794 13.0429 18.2816 12.2917L18.2833 12.2782C18.3672 11.5834 18.3998 10.702 18.3998 9.29942ZM5.72869 12.2889C5.83006 13.0522 6.00585 13.7256 6.27592 14.3316C4.44758 12.9315 3.19763 10.814 2.94656 8.39961H5.59987L5.59986 9.2994C5.59986 10.6376 5.63252 11.5317 5.72803 12.2838L5.72869 12.2889Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconTrophyFill;
