import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 현재 또는 특정 위치를 표현합니다.
 * 키워드: GPS, Location, Place, 좌표, 위치
 * 속성: Outlined
 */
const IconLocation = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M16.4026 18.8796C15.4296 19.9049 14.4598 20.7426 13.7342 21.3236C13.3346 21.6435 12.9279 21.9581 12.504 22.2456C12.2035 22.4483 11.7939 22.4475 11.4938 22.2444C11.0706 21.9571 10.6644 21.6431 10.2654 21.3236C9.53984 20.7426 8.56995 19.9049 7.59697 18.8796C5.69091 16.8709 3.59982 13.9624 3.59982 10.7496C3.59982 6.11042 7.36062 2.34961 11.9998 2.34961C16.639 2.34961 20.3998 6.11042 20.3998 10.7496C20.3998 13.9624 18.3087 16.8709 16.4026 18.8796ZM11.9998 4.14941C8.35473 4.14941 5.39982 7.10433 5.39982 10.7494C5.39982 13.2305 7.05872 15.6972 8.90266 17.6403C10.1141 18.917 11.3358 19.8935 11.9998 20.3906C12.6638 19.8935 13.8855 18.917 15.0969 17.6403C16.9409 15.6972 18.5998 13.2305 18.5998 10.7494C18.5998 7.10433 15.6449 4.14941 11.9998 4.14941Z"
        fill="currentColor"
      />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M11.9999 7.09961C9.9841 7.09961 8.34995 8.73377 8.34995 10.7496C8.34995 12.7654 9.9841 14.3996 11.9999 14.3996C14.0158 14.3996 15.6499 12.7654 15.6499 10.7496C15.6499 8.73377 14.0158 7.09961 11.9999 7.09961ZM10.1499 10.7496C10.1499 9.72788 10.9782 8.89961 11.9999 8.89961C13.0217 8.89961 13.8499 9.72788 13.8499 10.7496C13.8499 11.7713 13.0217 12.5996 11.9999 12.5996C10.9782 12.5996 10.1499 11.7713 10.1499 10.7496Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconLocation;
