import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 레이아웃을 표현합니다.
 * 키워드: 템플릿, 레이아웃, 스플릿, Template, Layout, Split
 * 속성: Solid
 */
const IconTemplateFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M8.26256 2.60254H15.7379C16.546 2.60253 17.2068 2.60252 17.7439 2.6464C18.2998 2.69182 18.8019 2.7887 19.2708 3.02762C20.0046 3.40152 20.6012 3.99815 20.9751 4.73198C21.2141 5.20087 21.3109 5.70295 21.3564 6.25886C21.4002 6.79594 21.4002 7.45679 21.4002 8.26484V8.60079H2.60028V8.26484C2.60027 7.4568 2.60026 6.79593 2.64414 6.25886C2.68956 5.70295 2.78645 5.20087 3.02536 4.73198C3.39926 3.99815 3.99588 3.40152 4.72971 3.02762C5.1986 2.7887 5.70067 2.69182 6.25659 2.6464C6.79365 2.60252 7.45453 2.60253 8.26256 2.60254Z"
        fill="currentColor"
      />
      <path
        d="M2.60028 10.4008V15.7402C2.60027 16.5483 2.60026 17.2092 2.64414 17.7462C2.68956 18.3021 2.78645 18.8042 3.02536 19.2731C3.39926 20.0069 3.99588 20.6036 4.72971 20.9775C5.1986 21.2164 5.70067 21.3133 6.25659 21.3587C6.79366 21.4026 7.45451 21.4026 8.26256 21.4025H8.59993V10.4008H2.60028Z"
        fill="currentColor"
      />
      <path
        d="M10.3999 21.4025H15.7379C16.546 21.4026 17.2068 21.4026 17.7439 21.3587C18.2998 21.3133 18.8019 21.2164 19.2708 20.9775C20.0046 20.6036 20.6012 20.0069 20.9751 19.2731C21.2141 18.8042 21.3109 18.3021 21.3564 17.7462C21.4002 17.2092 21.4002 16.5483 21.4002 15.7403V10.4008H10.3999V21.4025Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconTemplateFill;
