import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 해시태그를 표현합니다.
 * 키워드: Hashtag, tag, 해시태그, 태그, 해시태그, 샵
 * 속성: Outlined
 */
const IconHashTag = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M16.8304 3.06787C16.9591 2.58809 17.453 2.30275 17.9329 2.43115C18.413 2.5598 18.6983 3.05455 18.5696 3.53467L17.4973 7.5376H21.8704C22.3674 7.53765 22.7707 7.94101 22.7708 8.43799C22.7708 8.93501 22.3674 9.33832 21.8704 9.33838H17.0149L15.6223 14.5376H20.1204C20.6174 14.5376 21.0207 14.941 21.0208 15.438C21.0208 15.935 20.6174 16.3383 20.1204 16.3384H15.1389L13.9114 20.9214C13.7827 21.4014 13.2879 21.6867 12.8079 21.5581C12.3279 21.4293 12.0426 20.9346 12.1712 20.4546L13.2737 16.3384H8.13895L6.91141 20.9214C6.78266 21.4014 6.28793 21.6867 5.80789 21.5581C5.32794 21.4293 5.04255 20.9346 5.17117 20.4546L6.27371 16.3384H2.12039C1.62333 16.3384 1.22 15.935 1.22 15.438C1.22005 14.941 1.62337 14.5376 2.12039 14.5376H6.75613L8.14969 9.33838H3.87039C3.37333 9.33838 2.97 8.93504 2.97 8.43799C2.97005 7.94097 3.37337 7.5376 3.87039 7.5376H8.63211L9.83035 3.06787C9.95914 2.58809 10.453 2.30275 10.9329 2.43115C11.413 2.5598 11.6983 3.05455 11.5696 3.53467L10.4973 7.5376H15.6321L16.8304 3.06787ZM8.62234 14.5376H13.7561L15.1497 9.33838H10.0149L8.62234 14.5376Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconHashTag;
