import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 이해에 도움이 되는 정보를 표시할 때 사용합니다.
 * 키워드: 물음표, 추가 정보, Question, Additional Information
 * 속성: Outlined
 */
const IconCircleQuestion = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M11.1897 13.0148C11.1028 13.4917 11.5093 13.8908 11.9941 13.8908C12.4782 13.8908 12.8454 13.4845 13.0071 13.0283C13.2204 12.4264 13.6531 12.0647 14.0839 11.7046C14.6812 11.2053 15.275 10.709 15.275 9.57944C15.275 7.83142 13.8586 6.80195 12.0553 6.80195C10.4165 6.80195 9.18051 7.6659 8.81928 9.06834C8.69831 9.53798 9.10535 9.93872 9.59032 9.93872C10.0741 9.93872 10.4294 9.52024 10.6537 9.09164C10.8948 8.6309 11.3584 8.36801 11.9862 8.36343C12.8499 8.37034 13.451 8.8678 13.451 9.64854C13.451 10.2808 13.0553 10.5818 12.5898 10.936C12.0449 11.3505 11.4041 11.838 11.1897 13.0148Z"
        fill="currentColor"
      />
      <path
        d="M10.8807 16.0603C10.8738 16.6821 11.3437 17.1381 12 17.1381C12.6426 17.1381 13.1124 16.6821 13.1193 16.0603C13.1124 15.4384 12.6426 14.9824 12 14.9824C11.3437 14.9824 10.8738 15.4384 10.8807 16.0603Z"
        fill="currentColor"
      />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M11.9999 2.1001C6.53231 2.1001 2.09995 6.53248 2.09995 12.0001C2.09995 17.4677 6.53231 21.9001 11.9999 21.9001C17.4675 21.9001 21.8999 17.4677 21.8999 12.0001C21.8999 6.53248 17.4675 2.1001 11.9999 2.1001ZM3.89994 12.0001C3.89994 7.52659 7.52642 3.9001 11.9999 3.9001C16.4734 3.9001 20.0999 7.52659 20.0999 12.0001C20.0999 16.4736 16.4734 20.1001 11.9999 20.1001C7.52642 20.1001 3.89994 16.4736 3.89994 12.0001Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconCircleQuestion;
