import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 콘텐츠를 일시정지할 때 사용합니다.
 * 키워드: Pause, 일시정지, 정지, 잠깐, Wait
 * 속성: Outlined
 */
const IconPause = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M5.74997 6V18C5.74997 18.465 5.74997 18.6975 5.80108 18.8882C5.93978 19.4059 6.3441 19.8102 6.86174 19.9489C7.05249 20 7.28498 20 7.74996 20C8.21495 20 8.44744 20 8.63819 19.9489C9.15583 19.8102 9.56015 19.4059 9.69885 18.8882C9.74996 18.6975 9.74996 18.465 9.74996 18V6C9.74996 5.53501 9.74996 5.30252 9.69885 5.11177C9.56015 4.59413 9.15583 4.18981 8.63819 4.05111C8.44744 4 8.21495 4 7.74996 4C7.28498 4 7.05249 4 6.86174 4.05111C6.3441 4.18981 5.93978 4.59413 5.80108 5.11177C5.74997 5.30252 5.74997 5.53501 5.74997 6Z"
        fill="currentColor"
      />
      <path
        d="M18.1988 5.11177C18.2499 5.30252 18.2499 5.53501 18.2499 6V18C18.2499 18.465 18.2499 18.6975 18.1988 18.8882C18.0601 19.4059 17.6558 19.8102 17.1382 19.9489C16.9474 20 16.7149 20 16.2499 20C15.785 20 15.5525 20 15.3617 19.9489C14.8441 19.8102 14.4398 19.4059 14.3011 18.8882C14.2499 18.6975 14.2499 18.465 14.2499 18V6C14.2499 5.53501 14.2499 5.30252 14.3011 5.11177C14.4398 4.59413 14.8441 4.18981 15.3617 4.05111C15.5525 4 15.785 4 16.2499 4C16.7149 4 16.9474 4 17.1382 4.05111C17.6558 4.18981 18.0601 4.59413 18.1988 5.11177Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconPause;
