import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 텍스트 포맷을 표현합니다.
 * 키워드: Type
 * 속성: Outlined
 */
const IconTextFormat = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M7.18664 5.49805C6.52133 5.49805 5.92488 5.90819 5.68677 6.52943L1.59515 17.2045C1.35548 17.8298 1.81714 18.5012 2.48681 18.5012C2.88783 18.5012 3.24612 18.2506 3.38373 17.874L4.44062 14.981H9.92367L10.9796 17.8712C11.1178 18.2495 11.4776 18.5012 11.8804 18.5012C12.553 18.5012 13.0167 17.8269 12.776 17.1989L8.6865 6.52943C8.44839 5.90819 7.85194 5.49805 7.18664 5.49805ZM7.13408 7.60836H7.23022L9.28065 13.2209H5.08364L7.13408 7.60836Z"
        fill="currentColor"
      />
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M17.9807 12.799L20.3325 12.669C20.3039 11.2656 19.6362 10.5988 18.295 10.5988C17.5798 10.5988 17.0379 10.7849 16.6163 11.1907C16.2831 11.5116 15.8046 11.7021 15.3819 11.5142C14.9127 11.3057 14.7102 10.7332 15.0423 10.3417C15.8104 9.43593 16.8995 8.98242 18.295 8.98242C20.7479 8.98242 22.1384 10.3837 22.1384 12.772V17.5988C22.1384 18.0972 21.7344 18.5013 21.236 18.5013C20.7375 18.5013 20.3335 18.0972 20.3335 17.5988V17.1004H20.2614C19.631 18.1415 18.512 18.7527 17.2982 18.7527C15.6435 18.7527 14.1372 17.5176 14.1372 15.8163C14.1372 13.7514 16.2088 12.8651 17.9807 12.799ZM20.3334 14.8822V14.0176L18.0255 14.1727C17.0691 14.2249 16.005 14.6626 16.005 15.7712C16.005 16.6572 16.6815 17.1721 17.8549 17.1721C19.3988 17.1721 20.3334 16.2434 20.3334 14.8822Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconTextFormat;
