import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 사각형을 표현합니다.
 * 키워드: Square, Rectangle, 정사각형, 사각형
 * 속성: Solid
 */
const IconSquareFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M8.2625 2.59961C7.45445 2.5996 6.7936 2.59959 6.25652 2.64347C5.70061 2.68889 5.19854 2.78577 4.72965 3.02468C3.99582 3.39859 3.3992 3.99521 3.02529 4.72905C2.78638 5.19794 2.6895 5.70001 2.64408 6.25593C2.6002 6.793 2.60021 7.45385 2.60022 8.2619V15.7373C2.60021 16.5454 2.6002 17.2062 2.64408 17.7433C2.6895 18.2992 2.78638 18.8013 3.02529 19.2702C3.3992 20.004 3.99582 20.6006 4.72965 20.9745C5.19854 21.2134 5.70061 21.3103 6.25652 21.3557C6.7936 21.3996 7.45444 21.3996 8.26249 21.3996H15.7379C16.5459 21.3996 17.2068 21.3996 17.7438 21.3557C18.2998 21.3103 18.8018 21.2134 19.2707 20.9745C20.0045 20.6006 20.6012 20.004 20.9751 19.2702C21.214 18.8013 21.3109 18.2992 21.3563 17.7433C21.4002 17.2062 21.4002 16.5454 21.4001 15.7373V8.26191C21.4002 7.45385 21.4002 6.793 21.3563 6.25593C21.3109 5.70001 21.214 5.19794 20.9751 4.72905C20.6012 3.99521 20.0045 3.39859 19.2707 3.02468C18.8018 2.78577 18.2998 2.68889 17.7438 2.64347C17.2068 2.59959 16.5459 2.5996 15.7379 2.59961H8.2625Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconSquareFill;
