import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 깃발을 표현합니다.
 * 키워드: 휘날림, Milestone, 마일스톤
 * 속성: Outlined
 */
const IconFlag = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M5.15007 16.1492L5.2776 16.1067C7.47391 15.3746 9.86668 15.5071 11.9687 16.4773L12.3451 16.651C14.1477 17.4829 16.1433 17.8068 18.1165 17.5875L18.5151 17.5432C19.7305 17.4082 20.6501 16.3808 20.6501 15.1579V4.50049C20.6501 4.24449 20.541 4.00061 20.3503 3.82988C20.1595 3.65914 19.9051 3.57773 19.6507 3.606L17.9177 3.79854C16.2704 3.98158 14.6043 3.71122 13.0994 3.01663L12.0873 2.5495C9.97785 1.57593 7.57668 1.44294 5.37266 2.17761C4.16479 2.58023 3.35007 3.7106 3.35007 4.98381V15.4795C3.34974 15.4934 3.34974 15.5073 3.35007 15.5212V21.0005C3.35007 21.4975 3.75301 21.9005 4.25007 21.9005C4.74712 21.9005 5.15007 21.4975 5.15007 21.0005V16.1492ZM11.333 4.18383C9.63933 3.40215 7.71145 3.29538 5.94187 3.88524C5.46901 4.04286 5.15007 4.48537 5.15007 4.98381V14.2621C7.65732 13.5429 10.3454 13.7456 12.723 14.8429L13.0994 15.0166C14.6043 15.7112 16.2704 15.9816 17.9177 15.7985L18.3163 15.7543C18.6202 15.7205 18.8501 15.4637 18.8501 15.1579V5.50603L18.1165 5.58754C16.1433 5.80678 14.1477 5.48294 12.3451 4.65096L11.333 4.18383Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconFlag;
