import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 국가나 언어를 변경할 때 사용합니다.
 * 키워드: 글로벌, Globe, Global, 지구본
 * 속성: Solid
 */
const IconGlobeFill = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M7.52341 15.8994C7.99412 18.0271 8.84126 19.9943 9.98337 21.6943C6.78769 21.0328 4.15606 18.8308 2.89841 15.8994H7.52341Z"
        fill="currentColor"
      />
      <path
        d="M21.1015 15.8994C19.8433 18.8316 17.2107 21.0336 14.0136 21.6943C15.1561 19.9941 16.0045 18.0274 16.4756 15.8994H21.1015Z"
        fill="currentColor"
      />
      <path
        d="M14.6308 15.8994C14.1171 17.9846 13.2035 19.8607 11.999 21.418C10.7947 19.8608 9.88134 17.9847 9.36813 15.8994H14.6308Z"
        fill="currentColor"
      />
      <path
        d="M21.6748 9.89941C21.8211 10.5766 21.9004 11.279 21.9004 12C21.9003 12.7202 21.8219 13.4221 21.6758 14.0986H16.7783C16.8582 13.4107 16.9003 12.7102 16.9004 12C16.9004 11.2893 16.8582 10.5878 16.7783 9.89941H21.6748Z"
        fill="currentColor"
      />
      <path
        d="M7.22165 9.89941C7.14175 10.5878 7.09958 11.2893 7.09958 12C7.0996 12.7102 7.14181 13.4107 7.22165 14.0986H2.32516C2.17906 13.4221 2.09961 12.7202 2.09958 12C2.09958 11.2791 2.17883 10.5766 2.32516 9.89941H7.22165Z"
        fill="currentColor"
      />
      <path
        d="M14.9648 9.89941C15.0521 10.5832 15.0996 11.2846 15.0996 12C15.0996 12.7148 15.053 13.4154 14.9658 14.0986H9.03513C8.948 13.4153 8.90038 12.7149 8.90036 12C8.90036 11.2846 8.94793 10.5832 9.03513 9.89941H14.9648Z"
        fill="currentColor"
      />
      <path
        d="M14.0146 2.30469C17.2108 2.96549 19.8432 5.16743 21.1015 8.09863H16.4756C16.0046 5.97092 15.1568 4.00456 14.0146 2.30469Z"
        fill="currentColor"
      />
      <path
        d="M9.98239 2.30566C8.84097 4.00517 7.99495 5.9716 7.52438 8.09863H2.89938C4.1572 5.1685 6.78776 2.96728 9.98239 2.30566Z"
        fill="currentColor"
      />
      <path
        d="M11.999 2.58105C13.2035 4.13815 14.1172 6.0135 14.6308 8.09863H9.36813C9.88127 6.01347 10.7947 4.13809 11.999 2.58105Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconGlobeFill;
