import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 애플 로고를 표현합니다.
 * 키워드: 애플, 로고, Apple, Icon, Size, Small
 */
const IconLogoAppleColor = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        d="M8.95556 21.4457C10.2363 21.4457 10.798 20.5581 12.3933 20.5581C13.9886 20.5581 14.3706 21.412 15.7861 21.412C17.2017 21.412 18.1117 20.0863 18.9992 18.7831C19.9879 17.2889 20.3923 15.8284 20.426 15.761C20.3361 15.7385 17.6623 14.6038 17.6623 11.4469C17.6623 8.70565 19.7744 7.46985 19.8867 7.37997C18.4937 5.31281 16.3703 5.26788 15.7974 5.26788C14.2358 5.26788 12.955 6.24528 12.1462 6.24528C11.2811 6.24528 10.1352 5.32405 8.7758 5.32405C6.19186 5.32405 3.57422 7.52602 3.57422 11.6716C3.57422 14.2443 4.55162 16.9743 5.74248 18.7381C6.76482 20.2323 7.66359 21.4569 8.95556 21.4569V21.4457ZM12.2473 5.02072C13.1797 5.02072 14.3594 4.36911 15.0559 3.50405C15.685 2.71763 16.1457 1.61664 16.1457 0.515654C16.1457 0.369605 16.1344 0.212321 16.1007 0.0999756C15.0559 0.144914 13.8089 0.818989 13.0562 1.72899C12.4607 2.42553 11.9215 3.50405 11.9215 4.61627C11.9215 4.77356 11.9439 4.94207 11.9664 4.99825C12.0338 5.00948 12.1349 5.02072 12.2473 5.02072Z"
        fill="black"
      />
    </Box>
  );
});

export default IconLogoAppleColor;
