import { Box } from '@wanteddev/wds-engine';
import { forwardRef } from 'react';

import type { SxProp } from '@wanteddev/wds-engine';
import type { ComponentPropsWithoutRef } from 'react';

type Props = ComponentPropsWithoutRef<'svg'> & {
  sx?: SxProp;
};

/**
 * 새 정보와 관련한 내용을 표현할 때 사용합니다.
 * 키워드: 노티피케이션, 벨, 알람, Ring, Bell, Alarm Center, Notification, Noti, Notify
 * 속성: Outlined
 */
const IconBell = forwardRef<SVGSVGElement, Props>((props, ref) => {
  return (
    <Box
      as="svg"
      viewBox="0 0 24 24"
      fill="none"
      xmlns="http://www.w3.org/2000/svg"
      width="1em"
      height="1em"
      ref={ref}
      {...props}
    >
      <path
        fillRule="evenodd"
        clipRule="evenodd"
        d="M11.9999 2.1001C9.77471 2.1001 7.94532 2.88789 6.68783 4.37443C5.4477 5.84044 4.84996 7.8832 4.84996 10.2501L4.84997 11.0001C4.84997 13.4652 4.16674 14.9249 3.19362 15.8682C2.81208 16.2381 2.77247 16.7499 2.90886 17.1264C3.04756 17.5094 3.42766 17.9001 3.99952 17.9001H20.0003C20.5722 17.9001 20.9523 17.5094 21.091 17.1264C21.2274 16.7499 21.1878 16.2381 20.8063 15.8682C19.8331 14.9249 19.1499 13.4652 19.1499 11.0001L19.1499 10.2501C19.1499 7.8832 18.5522 5.84044 17.312 4.37443C16.0546 2.88789 14.2252 2.1001 11.9999 2.1001ZM6.64996 10.2501C6.64996 8.16522 7.17722 6.58298 8.06208 5.53693C8.92958 4.51142 10.2252 3.9001 11.9999 3.9001C13.7747 3.9001 15.0703 4.51142 15.9378 5.53693C16.8227 6.58297 17.3499 8.16522 17.3499 10.2501L17.3499 11.0001C17.3499 13.1628 17.8181 14.8273 18.6686 16.1001H5.33125C6.18182 14.8273 6.64996 13.1628 6.64996 11.0001L6.64996 10.2501Z"
        fill="currentColor"
      />
      <path
        d="M9.99995 20.0999C9.5029 20.0999 9.09995 20.5029 9.09995 20.9999C9.09995 21.497 9.5029 21.8999 9.99995 21.8999H13.9999C14.497 21.8999 14.8999 21.497 14.8999 20.9999C14.8999 20.5029 14.497 20.0999 13.9999 20.0999H9.99995Z"
        fill="currentColor"
      />
    </Box>
  );
});

export default IconBell;
